#1
# x = int(input('введите число x: '))
# y = int(input('введите число y: '))
# day = 1
# while x <= y:
#     x = x * 1.1
#     day += 1
# print ('На', day, 'день пробег составил', y, 'километров')

#2
# x = int(input('СКОКА ДЕНЕГ В БАНКЕ: '))
# p = int(input('Под какой процент положены деньги: '))
# y = int(input('скока денег должно быть: '))
# p = p / 100
# year = 0
# while y > x:
#      x = x * (1 + p)
#      x = round(x)
#      year += 1
# print ('Для достижения суммы', y, 'понадобилось', year, 'лет')