#№1
# x = float(input('Первый скорость - ' ))
# y = float(input('Конечная скорость - '))
# k = 1
# while x <= y :
#     x = x * 1.1
#     k = k + 1
# else:
#     # print('Количество дней до конечной скорости - ', k) 


#№2
# x = int(input('Введите вклад в банке - ', ))
# p = int(input('Введите проценты - '))
# y = int(input('Конечный вклад - '))
# k = 0
# while x <= y:
#     x = x + x * (p/ 100)
#     k = k + 1
# else:
#     print('Количество дней до конечного вклада - ', k)
